cfg/Reports/ЛичнаяКарточка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ЛичнаяКарточка</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cfg/Reports/ЛичнаяКарточка/Forms/ФормаГлавная/Ext/Form/Module.bsl
Перем ДокументРезультат1;
Перем ДокументРезультат2;
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "Перед открытием" формы отчета.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	// Установим дату начала отчета
	Если ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда
		ДатаАктуальности = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяДатаНачалаОтчетов");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = ОбщегоНазначения.ПолучитьРабочуюДату()
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ФормаОтчета) Тогда
		ФормаОтчета = 2009;
	КонецЕсли;

	
КонецПроцедуры // ПередОткрытием()

// Процедура - обработчик события "При открытии" формы отчета.
//
Процедура ПриОткрытии()

	Если ВладелецФормы <> Неопределено Тогда
		
		ЕстьОшибки = Ложь;
		//СформироватьОтчет(ЭлементыФормы.ДокументРезультат, ЕстьОшибки);

	КонецЕсли;

КонецПроцедуры // ПриОткрытии()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ

// Процедура - обработчик нажатия кнопки "Сформировать"
//
Процедура КнопкаСформироватьНажатие(Элемент)

	ЕстьОшибки = Ложь;
	ЭлементыФормы.ДокументРезультат.Очистить();
	Если ФормаОтчета = 2009 Тогда
		ПечатьФорма2009(ЭлементыФормы.ДокументРезультат, ДатаАктуальности,Работник ,Работник.Организация, Работник, Ложь);
	ИначеЕсли ФормаОтчета = 2008 Тогда	
		ДокументРезультат1 = Новый ТабличныйДокумент;
		ДокументРезультат2 = Новый ТабличныйДокумент;
		ПечатьФорма2008Сторона1(ДокументРезультат1, ДатаАктуальности,Работник ,Работник.Организация, Работник, Ложь);
		ПечатьФорма2008Сторона2(ДокументРезультат2, ДатаАктуальности,Работник ,Работник.Организация, Работник, Ложь);
		
		ЭлементыФормы.ДокументРезультат.Вывести(ДокументРезультат1);
		ЭлементыФормы.ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		ЭлементыФормы.ДокументРезультат.Вывести(ДокументРезультат2);
   	Иначе
		ПечатьФорма1995(ЭлементыФормы.ДокументРезультат, ДатаАктуальности,Работник ,Работник.Организация, Работник, Ложь);
	КонецЕсли;
		
	
КонецПроцедуры // КнопкаСформироватьНажатие()

Процедура БланкНажатие(Элемент)
	
	ЭлементыФормы.ДокументРезультат.Очистить();
	Если ФормаОтчета = 2009 Тогда
		ПечатьФорма2009(ЭлементыФормы.ДокументРезультат, ДатаАктуальности, NULL, NULL, NULL, Истина)
	ИначеЕсли ФормаОтчета = 2008 Тогда
		ДокументРезультат1 = Новый ТабличныйДокумент;
		ДокументРезультат2 = Новый ТабличныйДокумент;
		ПечатьФорма2008Сторона1(ДокументРезультат1, ДатаАктуальности,NULL ,NULL, NULL, Истина);
		ПечатьФорма2008Сторона2(ДокументРезультат2, ДатаАктуальности,NULL ,NULL, NULL, Истина);
		  		
		ЭлементыФормы.ДокументРезультат.Вывести(ДокументРезультат1);
		ЭлементыФормы.ДокументРезультат.Вывести(ДокументРезультат2);

	Иначе
		ПечатьФорма1995(ЭлементыФормы.ДокументРезультат, ДатаАктуальности, null , null, null, Истина);
	КонецЕсли;
КонецПроцедуры


// Процедура - обработчик нажатия кнопки "На принтер"
Процедура ДействияФормыНаПринтер(Кнопка)	
	Если ФормаОтчета = 2008 Тогда
		ДокументРезультат1.Напечатать();
		ДокументРезультат2.Напечатать();
	Иначе
		ЭлементыФормы.ДокументРезультат.Напечатать();
	КонецЕсли;
КонецПроцедуры

// Обработчик события элемента КоманднаяПанельФормы.НовыйОтчет.
//
Процедура ДействияФормыНовыйОтчет(Кнопка)
	
	Если Строка(ЭтотОбъект) = "ВнешняяОбработкаОбъект." + ЭтотОбъект.Метаданные().Имя Тогда
			
		Предупреждение(НСтр("ru='Данный отчет является внешней обработкой.';uk='Даний звіт є зовнішньою обробкою.'") + Символы.ПС + НСтр("ru='Открытие нового отчета возможно только для объектов конфигурации.';uk=""Відкриття нового звіту можливо тільки для об'єктів конфігурації."""));
		Возврат;
			
	Иначе
			
		НовыйОтчет = Отчеты[ЭтотОбъект.Метаданные().Имя].Создать();
			
	КонецЕсли;
	
	ФормаНовогоОтчета = НовыйОтчет.ПолучитьФорму();
	ФормаНовогоОтчета.Открыть();

КонецПроцедуры // КоманднаяПанельФормыДействиеНовыйОтчет()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ДИАЛОГА

Процедура СотрудникНачалоВыбора(Элемент, СтандартнаяОбработка)
	ПроцедурыУправленияПерсоналом.ОткрытьФормуВыбораСотрудникаОрганизации(Элемент, ЭтотОбъект, Истина, ДатаАктуальности, , 1, СтандартнаяОбработка, Элемент.Значение);
КонецПроцедуры

Процедура СотрудникАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	ТекстАвтоПодбора = ПроцедурыУправленияПерсоналом.ПодобратьФИОРаботникаКандидата(СтандартнаяОбработка, "РаботникиОрганизации", Текст);
КонецПроцедуры

Процедура СотрудникОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	Значение = ПроцедурыУправленияПерсоналом.ПодобратьСписокРаботниковКандидатов(СтандартнаяОбработка, "РаботникиОрганизации", Текст, Элемент.Значение);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
ДокументРезультат1 = Новый ТабличныйДокумент;
ДокументРезультат2 = Новый ТабличныйДокумент;
